merlokk/ai-remote/approver-esp32-yubikey/sdkconfig.defaults
# The committed half of the configuration (CLAUDE.md §10.14.4): the real
# `sdkconfig` is generated by `idf.py set-target esp32s3` and is not committed.

CONFIG_IDF_TARGET="esp32s3"

# --- The memory this board actually has -------------------------------------
# **Read off the chip rather than off a product page** (§10.1). The YD-ESP32-S3
# ships in several variants; `esptool flash-id` on the board on this desk said
# 16 MB of quad flash and 8 MB of embedded PSRAM (AP_3v3), which is the R8 part
# and therefore **octal** PSRAM. Getting either of these wrong is a device that
# boots until something touches the wrong end of a bus.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# **Added to the heap, and this firmware still does not allocate** (§10.14.1).
# The two are not in tension: everything this code owns is static, and what asks
# for heap is other people's — the Wi-Fi driver's TX buffers, lwIP's pools, the
# USB Host Library's transfer descriptors, cJSON while it parses. On the C6 board
# those five competed for about 200 KB of internal RAM and §10.16 has the
# post-mortem of what happened when they lost. Here there are eight megabytes
# behind them, which is the one thing this board is unambiguously better at.
CONFIG_SPIRAM_USE_MALLOC=y

# The layout in partitions.csv — two 2.5 MB OTA slots, the rest storage (§10.12).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# C++ without exceptions or RTTI (§10.14.1). Both are already the IDF default;
# they are written down so a menuconfig session cannot flip them by accident.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# --- The console, and the one line where this board differs most -------------
#
# **UART, not USB Serial/JTAG**, and it is the opposite of what the sibling
# folder's `sdkconfig.defaults` sets. That board has one USB-C wired to the chip's
# own USB peripheral, so its console has to live there. This one has **two**: a
# CH343P bridge on UART0 (GPIO43/44), and the S3's native USB — and the native USB
# has another job (§10.18.3), which is being a *host* for a security key.
#
# A console on USB Serial/JTAG here would mean choosing between talking to the
# device and using a key on it. The bridge is what makes both possible at once,
# and it is why this board was the right one for this design.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# **`help` lists the commands in the order they were registered, not sorted**, and
# that order is `console.cpp`'s `kCommands` — grouped the way somebody learning
# this device would want them (what it is, what it is doing about approvals, the
# hardware, the settings, the network, the bus, the identity, the site, the files)
# rather than alphabetically.
#
# This is ESP-IDF's own default, so the line changes nothing today. It is here
# because the grouping is a decision somebody made and the comment above
# `kCommands` asserts it: with sorted help on, that assertion silently becomes
# false and no test in any tier would notice. Pinning it is cheaper than a
# comment saying "do not turn this on".
CONFIG_CONSOLE_SORTED_HELP=n

# --- The USB peripheral, as a host (§10.18.3) -------------------------------
#
# The Host Library is a managed component (`espressif/usb`), so most of its
# configuration arrives with it. What is set here is the part that is this
# firmware's decision:
#
# **One device, no hubs.** A key plugs straight into the OTG socket. Hub support
# costs code and an external-hub driver with error paths Espressif's own docs list
# as unimplemented, for a topology this device does not have.
CONFIG_USB_HOST_HUBS_SUPPORTED=n

# **8 KB for the main task**, and the reason it was raised is gone: `crypto::Init`
# used to derive an Ed25519 key and sign with it from `app_main`, and `crypto_sign`
# uses 4,112 bytes of stack against the framework's default of 3,584 — the first
# version of that code panicked here with a stack protection fault. §10.18 moved
# the signer into the security key and §10.6's identity has been deleted, so
# nothing in `app_main` signs anything now.
#
# It stays at 8 KB anyway, for two reasons and neither is inertia: **nobody has
# measured what `app_main` needs today** — it brings up storage, the config, the
# USB host and the responder — and it costs nothing after boot, because ESP-IDF
# deletes the main task when `app_main` returns and its stack goes back to the
# heap. Lowering it would be a guess dressed as a saving.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- libsodium (§10.4, §10.6) -----------------------------------------------
# **The SHA-512 underneath Ed25519.** §10.6 names this exact switch as a seam
# that has historically produced valid-looking but *wrong* Ed25519 output
# (esp-idf#1044), which is the whole reason that section asks for a boot self-test.
# What the self-test checks is now a **verify** rather than a sign — this board has
# no key to sign with — and a broken SHA breaks verification just as thoroughly:
# it would reject the handler's real reply, or accept one it should not.
# `y` is libsodium's own default; it is written down because it was checked rather
# than inherited, and because a menuconfig session that flips it is flipping the
# one thing on this device that has to be byte-exact.
#
# On the sibling board both settings were built, flashed and run against a vector
# generated by `lib/crypto.py`, and the historical bug was not present either way;
# what separated them was 10,780 bytes of flash in `y`'s favour. **That was
# measured on esp32c6 and this is esp32s3**, so it is a reasonable default rather
# than a repeated measurement — §10.11's device tier is where it gets re-checked
# on this chip, and the boot self-test is what makes being wrong loud.
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# --- FreeRTOS ----------------------------------------------------------------
# A 1 kHz tick, and on this board it is not the graphics library's ask that pays
# for it: it is kept because two things here are timed in tens of
# milliseconds — the button debounce (`buttons::kPollIntervalMs`, 10 ms) and the
# LED's blink phases (200 ms at the fastest) — and at the framework's default
# 100 Hz a 10 ms delay is a 10 ms *quantum*, which turns a debounce poll into a
# jittery one and a 200 ms blink into something that is sometimes 200 and
# sometimes 210.
CONFIG_FREERTOS_HZ=1000
